app/controllers/notes_controller.rb

  def index
    @notes = Note.all.order("created_at DESC")
---
SELECT "notes".* FROM "notes"   ORDER BY created_at DESC

  def create
    @note = current_user.notes.build(note_params)

    if @note.save
---
INSERT INTO "notes" ("content", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "dfsfdf"], ["created_at", "2015-03-04 23:46:09.950060"], ["title", "fsdfds"], ["updated_at", "2015-03-04 23:46:09.950060"], ["user_id", 1]]

  def update
    if @note.update(note_params)
---
UPDATE "notes" SET "picture" = ?, "updated_at" = ? WHERE "notes"."id" = 20  [["picture", "http://www.inc.com/uploaded_files/image/work-vacation-policy-pop_3122.jpg"], ["updated_at", "2015-06-04 20:08:43.227101"]]

  def find_note
   @note = Note.find(params[:id])
---
SELECT  "notes".* FROM "notes"  WHERE "notes"."id" = ? LIMIT 1  [["id", 8]]