app/controllers/notes_controller.rb

SELECT "notes".* FROM "notes"  WHERE "notes"."user_id" = 1
---
  def index
    @notes = Note.where(user_id: current_user)